<?php

// --------------------------------------------------------------------------
// Нормализация токена, разделение смешанных термов ("4asШkor0" => "4 as Ш kor 0")
// --------------------------------------------------------------------------

function normalize_name($str = '') {
	$arr = array(
		'let' => '[0-9]',
		'lat' => '[a-zA-Z]',
		'rus' => '[ёйцукенгшщзхъфывапролджэячсмитьбюЁЙЦУКЕНГШЩЗХЪФЫВАПРОЛДЖЭЯЧСМИТЬБЮ]'
	);

	$deny = array(
		'_' => '',
		'№' => ''
	);

	foreach($arr as $k=>$v) {
		$str = preg_replace('/(' . $v . '+)/isu', ' \\1 ', $str);
	}

	$arr = explode(' ', $str);
	foreach($arr as $k=>$v) {
		if(isset($deny[$v])) {
			unset($arr[$k]);
		}
	}
	$str = implode(' ', $arr);
	return preg_replace('/\s+/', ' ', trim($str));
}

?>